
<a href='http://www.pieriandata.com'><img src='../Pierian_Data_Logo.png'/></a>
___
<center><em>Copyright Pierian Data</em></center>
<center><em>For more information, visit us at <a href='http://www.pieriandata.com'>www.pieriandata.com</a></em></center>

# Pandas Exercises

**TASK: Import pandas**

In [49]:
# CODE HERE

import pandas as pd
import numpy as np

In [50]:
pwd

'/Users/billy/Desktop/DS_Master/Udemy/PyTorch_for_Deep_Learning/PYTORCH_NOTEBOOKS/07-My_Notebooks'

**TASK:  Read in the bank.csv file that is located under the 01-Crash-Course-Pandas folder. Pay close attention to where the .csv file is located! Please don't post to the QA forums if you can't figure this one out, instead, run our solutions notebook directly to see how its done.**

In [51]:
# CODE HERE

df_bank = pd.read_csv('~/Desktop/DS_Master/Udemy/PyTorch_for_Deep_Learning/PYTORCH_NOTEBOOKS/07-My_Notebooks/bank.csv')

**TASK: Display the first 5 rows of the data set**

In [52]:
# CODE HERE
df_bank.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,no
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no
2,35,management,single,tertiary,no,1350,yes,no,cellular,16,apr,185,1,330,1,failure,no
3,30,management,married,tertiary,no,1476,yes,yes,unknown,3,jun,199,4,-1,0,unknown,no
4,59,blue-collar,married,secondary,no,0,yes,no,unknown,5,may,226,1,-1,0,unknown,no

**TASK: What is the average (mean) age of the people in the dataset?**

In [53]:
# CODE HERE
df_bank['age'].mean()

41.17009511170095

**TASK: What is the marital status of the youngest person in the dataset?**

[HINT](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.idxmin.html)

In [54]:
# CODE HERE

#First let's chec the mini
min_age = df_bank['age'].argmin()

In [60]:
min_age = df_bank[df_bank['age'] == 19]

In [61]:
min_age #This shows the row number where the youngest person is
#Now let's find out the marital status of that row
mar = df_bank.iloc[503]['marital']
mar

'single'

**TASK: How many unique job categories are there?**

In [62]:
# CODE HERE
df_bank['job'].nunique()

12

12

**TASK: How many people are there per job category? (Take a peek at the expected output)**

In [63]:
# CODE HERE

In [64]:
df_bank.columns
df_bank['job'].value_counts()

management       969
blue-collar      946
technician       768
admin.           478
services         417
retired          230
self-employed    183
entrepreneur     168
unemployed       128
housemaid        112
student           84
unknown           38
Name: job, dtype: int64

**TASK: What percent of people in the dataset were married? **

In [70]:
#CODE HERE

married = (df_bank['marital'].value_counts()['married'] / len(df_bank)) * 100
married

61.86684361866843

**TASK: There is a column labeled "default". Use pandas' .map() method to create a new column called "default code" which contains a 0 if there was no default, or a 1 if there was a default. Then show the head of the dataframe with this new column.**

[Helpful Hint Link One](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.map.html)

[Helpful Hint Link Two](https://stackoverflow.com/questions/19798153/difference-between-map-applymap-and-apply-methods-in-pandas)

In [86]:
# CODE HERE

df_bank['default_code'] = df_bank['default'].map({'no': 0, 'yes' : 1})
df_bank['default_code'].head()
df_bank.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y,default_code
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,no,0
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no,0
2,35,management,single,tertiary,no,1350,yes,no,cellular,16,apr,185,1,330,1,failure,no,0
3,30,management,married,tertiary,no,1476,yes,yes,unknown,3,jun,199,4,-1,0,unknown,no,0
4,59,blue-collar,married,secondary,no,0,yes,no,unknown,5,may,226,1,-1,0,unknown,no,0

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y,default code
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,no,0
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no,0
2,35,management,single,tertiary,no,1350,yes,no,cellular,16,apr,185,1,330,1,failure,no,0
3,30,management,married,tertiary,no,1476,yes,yes,unknown,3,jun,199,4,-1,0,unknown,no,0
4,59,blue-collar,married,secondary,no,0,yes,no,unknown,5,may,226,1,-1,0,unknown,no,0

**TASK: Using pandas .apply() method, create a new column called "marital code". This column will only contained a shortened code of the possible marital status first letter. (For example "m" for "married" , "s" for "single" etc... See if you can do this with a lambda expression. Lots of ways to do this one!**

[Hint Link](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.apply.html)

In [ ]:
# CODE HERE

In [114]:
# Option 1 - Run apply against an anonymous lambda function 
# Then assign a new column

df_bank['marital_code'] = df_bank['marital'].apply(lambda status: status[0])
df_bank['marital_code'].head()
df_bank.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y,default_code,marital_code,marital code
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,no,0,m,m
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no,0,m,m
2,35,management,single,tertiary,no,1350,yes,no,cellular,16,apr,185,1,330,1,failure,no,0,s,s
3,30,management,married,tertiary,no,1476,yes,yes,unknown,3,jun,199,4,-1,0,unknown,no,0,m,m
4,59,blue-collar,married,secondary,no,0,yes,no,unknown,5,may,226,1,-1,0,unknown,no,0,m,m

In [111]:
# Option 2 - Define a simple function and apply that function as above
# Then assign a new column

def first(status):
    return status[0]

In [113]:
df_bank['marital code'] = df_bank['marital'].apply(first)
df_bank['marital code'].head()
df_bank.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y,default_code,marital_code,marital code
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,no,0,m,m
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no,0,m,m
2,35,management,single,tertiary,no,1350,yes,no,cellular,16,apr,185,1,330,1,failure,no,0,s,s
3,30,management,married,tertiary,no,1476,yes,yes,unknown,3,jun,199,4,-1,0,unknown,no,0,m,m
4,59,blue-collar,married,secondary,no,0,yes,no,unknown,5,may,226,1,-1,0,unknown,no,0,m,m

**TASK: What was the longest lasting duration?**

In [117]:
# CODE HERE

df_bank['duration'].max()

3025

3025

**TASK: What is the most common education level for people who are unemployed?**

In [127]:
# CODE HERE
df_bank['education'].value_counts().unique()
# Let's filter the people who are unemployed first

no_job = df_bank[df_bank['job'] == 'unemployed']
no_job['education'].value_counts()

secondary    68
tertiary     32
primary      26
unknown       2
Name: education, dtype: int64

secondary    68
tertiary     32
primary      26
unknown       2
Name: education, dtype: int64

**TASK: What is the average (mean) age for being unemployed?**

In [137]:
# CODE HERE

no_job.columns
no_job['age'].mean()


# or alternatively

df_bank[df_bank['job'] == 'unemployed']['age'].min()
df_bank[df_bank['job'] == 'unemployed']['age'].max()
df_bank[df_bank['job'] == 'unemployed']['age'].count()
df_bank[df_bank['job'] == 'unemployed']['age'].mean()

40.90625

40.90625